app/controllers/albums_controller.rb

  def index
      @albums = Album.all
---
SELECT "albums".* FROM "albums"

  def show
      @albums = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]